wstep-do-fil/17.11.20-w.org
#+TITLE: 17 11 20 W

* Monizm
- swiat jest zbudowany z jednego tworzywa
- problem ze sprowadzeniem bytów do jedności
- Leucyp, Demokryt, Epikur
** Materialistyczny
*** słaba wersja
- marksizm (teza genetyczna),
*** mocna wersja
** Idealistyczny/ spirytualistyczny
- jedna substancja, ma charakter niematerialny
*** słaba wersja
- filozofowie chrześcijańscy
*** mocna wersja
- Edmund Husserl
- George Berkeley
** Właściwy
- istnieje jedna substancja, przejawia sie na rózne sposoby
- substancja utożsamiana z nieskończonością albo jako byt niezróżnicowany
- np Spinoza

* Dualizm
- istnieją 2 tworzywa świata - niematerialne i materialne
** Aktualny
*** słaba wersja
- Arystoteles
- Tomasz z Akwinu - monista idealistyczny w teze genetycznej, w tezie aktualnej dualista
*** moca wersja
- Franz Brendano?

* Pluralizm
- jest wiele substancji tworzących świat
- Platon - Demiurg - twórca, idea - doskonała, pramateria - niedoskonała
- Empedokles - 4 elementy, żywioły
- Leibniz - wiele Monad (Monada l poj)
- Arystoteles - istnieje wiele rzeczy tworzących świat, bytów konkretnych jednostkowych

* Spór o przyczynową naturę świata
- jeżeli świat jest uporządkowany, to co go porządkuje?
** Determinizm
- każde zdarzenie w świecie zostało określone, nie ma w świecie zjawisk nieokreślonych
- poprzednie określa następne
- Demokryt z Abdery
- Galileusz
- Spinoza
- Hobbes
*** Kauzualizm
- prawo przyczynowo-skutkowe
** Indeterminizm
*** wersja słaba
- większość rewirów rzecywistości jest zdeterminowana, istnieją zjawiska nieuwarunkowane (np wolna wola)
- Epikur
*** wersja mocna
- wszystko w świecie jest przypadkowe
- Nieztsche

* Spór o celową naturę świata
- zakłada porządek świata
- lac /finis/ - cel
** Finalizm
- teleologia
- prawo celowe porządkuje świat
*** Finalizm wewnętrzny
- Platon, Arystoteles
- Arystoteles 4 przyczyny:
  - materialna (konkretna)
  - formalna - cechy gatunkowe
  - sprawcza - cos, co powołuje do istnienia
  - celowa - co jest celem substancji
- arystoteles uważ , że mozna zredukować przyczynę celową i sprawcza do przyczyny formalnej
*** Finalizm antropomorficzne
- byt osobowy stoi za celem
** Mechanicyzm
- świat działa jak maszyna, jest jednym wielkim mechanizmem
- można zaobserwowac prawa przyczynowo-skutkowe, ale nie prowadzą one do określonego celu
- Demokryt z Abdery
- Kartezjusz
- Darwinizm
