semestr1/wstep-do-fil/17.11.20-w.md

# Table of Contents

1.  [Monizm](#orgde9a91f)
    1.  [Materialistyczny](#org4a42e89)
        1.  [słaba wersja](#orgedf900d)
        2.  [mocna wersja](#org4e3ceb5)
    2.  [Idealistyczny/ spirytualistyczny](#orgfd8f58c)
        1.  [słaba wersja](#orge8f0b07)
        2.  [mocna wersja](#org5d29575)
    3.  [Właściwy](#orgbd831a4)
2.  [Dualizm](#org7df98bf)
    1.  [Aktualny](#org85228c6)
        1.  [słaba wersja](#orgf35318c)
        2.  [moca wersja](#org13b976e)
3.  [Pluralizm](#org739db00)
4.  [Spór o przyczynową naturę świata](#orga446657)
    1.  [Determinizm](#orgd64c2cf)
        1.  [Kauzualizm](#org97afb12)
    2.  [Indeterminizm](#orgf8ffa46)
        1.  [wersja słaba](#orga00e0e1)
        2.  [wersja mocna](#org5bcc0fd)
5.  [Spór o celową naturę świata](#org539bbb8)
    1.  [Finalizm](#org8cc0780)
        1.  [Finalizm wewnętrzny](#org3c815dd)
        2.  [Finalizm antropomorficzne](#org8b33945)
    2.  [Mechanicyzm](#orga9ba436)



<a id="orgde9a91f"></a>

# Monizm

-   swiat jest zbudowany z jednego tworzywa
-   problem ze sprowadzeniem bytów do jedności
-   Leucyp, Demokryt, Epikur


<a id="org4a42e89"></a>

## Materialistyczny


<a id="orgedf900d"></a>

### słaba wersja

-   marksizm (teza genetyczna),


<a id="org4e3ceb5"></a>

### mocna wersja


<a id="orgfd8f58c"></a>

## Idealistyczny/ spirytualistyczny

-   jedna substancja, ma charakter niematerialny


<a id="orge8f0b07"></a>

### słaba wersja

-   filozofowie chrześcijańscy


<a id="org5d29575"></a>

### mocna wersja

-   Edmund Husserl
-   George Berkeley


<a id="orgbd831a4"></a>

## Właściwy

-   istnieje jedna substancja, przejawia sie na rózne sposoby
-   substancja utożsamiana z nieskończonością albo jako byt niezróżnicowany
-   np Spinoza


<a id="org7df98bf"></a>

# Dualizm

-   istnieją 2 tworzywa świata - niematerialne i materialne


<a id="org85228c6"></a>

## Aktualny


<a id="orgf35318c"></a>

### słaba wersja

-   Arystoteles
-   Tomasz z Akwinu - monista idealistyczny w teze genetycznej, w tezie aktualnej dualista


<a id="org13b976e"></a>

### moca wersja

-   Franz Brendano?


<a id="org739db00"></a>

# Pluralizm

-   jest wiele substancji tworzących świat
-   Platon - Demiurg - twórca, idea - doskonała, pramateria - niedoskonała
-   Empedokles - 4 elementy, żywioły
-   Leibniz - wiele Monad (Monada l poj)
-   Arystoteles - istnieje wiele rzeczy tworzących świat, bytów konkretnych jednostkowych


<a id="orga446657"></a>

# Spór o przyczynową naturę świata

-   jeżeli świat jest uporządkowany, to co go porządkuje?


<a id="orgd64c2cf"></a>

## Determinizm

-   każde zdarzenie w świecie zostało określone, nie ma w świecie zjawisk nieokreślonych
-   poprzednie określa następne
-   Demokryt z Abdery
-   Galileusz
-   Spinoza
-   Hobbes


<a id="org97afb12"></a>

### Kauzualizm

-   prawo przyczynowo-skutkowe


<a id="orgf8ffa46"></a>

## Indeterminizm


<a id="orga00e0e1"></a>

### wersja słaba

-   większość rewirów rzecywistości jest zdeterminowana, istnieją zjawiska nieuwarunkowane (np wolna wola)
-   Epikur


<a id="org5bcc0fd"></a>

### wersja mocna

-   wszystko w świecie jest przypadkowe
-   Nieztsche


<a id="org539bbb8"></a>

# Spór o celową naturę świata

-   zakłada porządek świata
-   lac *finis* - cel


<a id="org8cc0780"></a>

## Finalizm

-   teleologia
-   prawo celowe porządkuje świat


<a id="org3c815dd"></a>

### Finalizm wewnętrzny

-   Platon, Arystoteles
-   Arystoteles 4 przyczyny:
    -   materialna (konkretna)
    -   formalna - cechy gatunkowe
    -   sprawcza - cos, co powołuje do istnienia
    -   celowa - co jest celem substancji
-   arystoteles uważ , że mozna zredukować przyczynę celową i sprawcza do przyczyny formalnej


<a id="org8b33945"></a>

### Finalizm antropomorficzne

-   byt osobowy stoi za celem


<a id="orga9ba436"></a>

## Mechanicyzm

-   świat działa jak maszyna, jest jednym wielkim mechanizmem
-   można zaobserwowac prawa przyczynowo-skutkowe, ale nie prowadzą one do określonego celu
-   Demokryt z Abdery
-   Kartezjusz
-   Darwinizm

